package tag.sources.checkmebot.utils;

public class TextConsts {
    public static final String TEXT_BOT_MESSAGE =
            "<strong>Работа с текстом</strong>\n" +
                    "\n" +
                    "Обработка простых команд и запросов, с возможность создания меню\n" +
                    "и обработкой текста по требованию\n" +
                    "\n" +
                    "<strong>Функционал:</strong>\n" +
                    "◉ Классические текстовые команды - /show \n" +
                    "◉ Меню с кнопками \n" +
                    "○ Сохранение тесктовых данных\n" +
                    "\n" +
                    "ℹ\uFE0F Отмеченные команды можно попробовать здесь, в демо-версии\n" +
                    "ℹ\uFE0F В заказе вы можете объеденить несколько функций из главного меню, или направить ТЗ с пожеланиями.";
    public static final Object BUSINESS_BOT_MESSAGE =
            "<strong>Для бизнеса и личного блога</strong>\n" +
                    "\n" +
                    "Список услуг, которые будут полезны в коммерческой сфере \n" +
                    "и которые можно реализовать с помощью этого бота\n" +
                    "Возможно вас заинтересует <strong>Взаимодействие с пользователями</strong>\n" +
                    "\n" +
                    "<strong>Функционал:</strong>\n" +
                    "○ Интеграция с внешним API и мониторинг ресурсов\n" +
                    "○ Трекер задач\n" +
                    "◉ Уведомлений по таймеру, настройка расписания\n" +
                    "○ Сохранение информации о заказах и брони. Подключение базы\n" +
                    "○ Настройка и деплой сервера бота \n" +
                    "\n" +
                    "ℹ\uFE0F Отмеченные команды можно попробовать здесь, в демо-версии\n" +
                    "ℹ\uFE0F В заказе вы можете объеденить несколько функций из главного меню, или направить ТЗ с пожеланиями.";
    public static final Object USER_BOT_MESSAGE =
            "<strong>Взаимодействие с пользователями</strong>\n" +
                    "\n" +
                    "Работа с пользователями телеграм-канала \n" +
                    "Можно использовать для обратной связи или разделения ролей\n" +
                    "\n" +
                    "<strong>Функционал:</strong>\n" +
                    "○ Создание пользователей и авторизация \n" +
                    "○ Управление правами пользователя, возможность ограничить доступ \n" +
                    "○ Сбор обратной связи, опросы, рассылки\n" +
                    "\n" +
                    "ℹ\uFE0F Отмеченные команды можно попробовать здесь, в демо-версии\n" +
                    "ℹ\uFE0F В заказе вы можете объеденить несколько функций из главного меню, или направить ТЗ с пожеланиями.";
    public static final Object FILES_BOT_MESSAGE =
            "<strong>Работа с файлами</strong>\n" +
                    "\n" +
                    "Подойдет для организации хранения данных. Возможность упорядочить \n" +
                    "созданную файловую систему. \n" +
                    "\n" +
                    "<strong>Функционал:</strong>\n" +
                    "○ Создание хранилища на сервере\n" +
                    "○ Сжатие файлов\n" +
                    "\n" +
                    "ℹ\uFE0F Отмеченные команды можно попробовать здесь, в демо-версии\n" +
                    "ℹ\uFE0F В заказе вы можете объеденить несколько функций из главного меню, или направить ТЗ с пожеланиями.";
    public static final Object INFO_BOT_MESSAGE =
            "";
    public static final Object START_BOT_MESSAGE =
            "Привет, я простой бот с базовым функционалом, сделанный, чтоб продемонстрировать свою работу. \n"
                    + "А вот ссылка на разработчика, который меня сделал:\n"
                    + "Рекомендую его как специалиста, говорят, он действительно классный!";
    public static final Object SCHEDULER_BOT_MESSAGE =
            "Сейчас вам доступна 1 задача через определенное время. \n"
                    + "В полноценной версии время и регулярность задач настраиваится в зависимости от ТЗ\n"
                    + "Подходит для новостей или напоминаний. \n";
    public static final String START_TASK_BOT_MESSAGE = "Готово, ожидайте уведомление";
}
